In [3]:
import pandas as pd

In [4]:
a=[10,20,30,40]
a

[10, 20, 30, 40]

In [5]:
data=pd.Series(a)
print(data)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
alpha=pd.DataFrame(a)
alpha

    0
0  10
1  20
2  30
3  40

In [7]:
print(data.values)
print(data.index)

[10 20 30 40]
RangeIndex(start=0, stop=4, step=1)

In [8]:
K=pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'],dtype=int)
print(K)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int32

In [9]:
b=pd.Series({'a':10,'b':20,'c':30,'d':40,'e':50},dtype=int)
b

a    10
b    20
c    30
d    40
e    50
dtype: int32

In [10]:
print(b.notnull())

a    True
b    True
c    True
d    True
e    True
dtype: bool

In [11]:
towns=['Gnt','Cpt','Ten','Ong']
print(pd.Series(a,index=towns))

Gnt    10
Cpt    20
Ten    30
Ong    40
dtype: int64

In [12]:
df=pd.DataFrame({"data":[10,20,30,40,50,60,70,80,90,100],"Year":[1,2,3,4,5,6,7,8,9,10]})
df

   data  Year
0    10     1
1    20     2
2    30     3
3    40     4
4    50     5
5    60     6
6    70     7
7    80     8
8    90     9
9   100    10

In [13]:
f=df.head()
f

   data  Year
0    10     1
1    20     2
2    30     3
3    40     4
4    50     5

In [14]:
g=df.tail()
g

   data  Year
5    60     6
6    70     7
7    80     8
8    90     9
9   100    10

In [18]:
l=g.set_index('data')
h=g.rename(columns={'data':'data1','Year':'Year1'})
h

   data1  Year1
5     60      6
6     70      7
7     80      8
8     90      9
9    100     10

In [16]:
pd.concat([f,g])

   data  Year
0    10     1
1    20     2
2    30     3
3    40     4
4    50     5
5    60     6
6    70     7
7    80     8
8    90     9
9   100    10